aviena,баранина
jautiena,говядина
kalakutiena,индейка
kiauliena,свинина
veršiena,телятина
vištiena,курятина
krevetės,креветки
lašiša,лосось
lydeka,щука
menkė,треска
tūnas,тунец
alyvuogės,оливки
ananasai,ананасы
apelsinai,апельсины
arbūzai,арбузы
avietės,малина
braškės,клубника
citrinos,лимоны
kriaušės,груши
mėlynės,черника
obuoliai,яблоки
serbentai,смородина
vynuogės,виноград
vyšnios,вишни
bandelė,булочка
batonas,батон
duona,хлеб
agurkai,огурцы
bulvės,картофель
burokėliai,свёкла
česnakai,чеснок
kopūstai,капуста
morkos,морковь
pomidorai,помидоры
pupelės,фасоль
ridikėliai,редис
svogūnai,лук, обычный репчатый
grietinė,сметана
jogurtas,йогурт
kefyras,кефир
pienas,молоко
rūgpienis,простокваша
sūris,сыр
sviestas,сливочное масло
varškė,творог
grietinėlė,сливки
ledai,мороженое
medus,мёд
pyragaitis,пирожное
pyragas,пирог
saldainiai,конфеты
šokoladas,шоколад
tortas,торт
avižos,овёс
grikiai,гречка
makaronai,макароны
riešutai,орехи
ryžiai,рис
traškučiai,чипсы
apkepas,запеканка
blyneliai,блины/блинчики
cepelinai,цеппелины
grybai,грибы
kepsnys,жаркое/стейк
kiaušinienė,яичница
kiaušinis,яйцо,одно яйцо
košė,каша
omletas,омлет
paštetas,паштет
salotos,салат
silkė,селёдка
sriuba,суп
sumuštinis,бутерброд
troškinys,рагу/тушёное блюдо
užkandis,закуска
alus,пиво
arbata,чай
brendis,бренди
degtinė,водка
kakava,какао
kava,кофе
kokteilis,коктейль
sultys,сок
vanduo,вода
vynas,вино
cukrus,сахар
druska,соль
padažas,соус
pipirai,перец
kmynai,тмин
aštrus,острый
baltas,белый
džiovintas,сушёный
karštas,горячий
keptas,жареный
liesas,постный/нежирный
mėgstamas,любимый
pjaustytas,нарезанный
raudonas,красный
riebus,жирный
rūgštus,кислый
rūkytas,копчёный
saldus,сладкий
sausas,сухой
senas,старый
silpnas,слабый
skanus,вкусный
smulkus,мелкий
stambus,крупный
stiprus,крепкий/сильный
sūrus,солёный
šviežias,свежий
trintas,протёртый,натертый на терке
virtas,варёный
žalias,зелёный
dubenėlis,миска
lėkštė,тарелка
lėkštutė,блюдце
peilis,нож
puodelis,чашка
stiklinė,стакан
šakutė,вилка
šaukštas,ложка
šaukštelis,ложечка,чайная
taurė,бокал
arbatpinigiai,чаевые
butelis,бутылка
dėžutė,коробка
gabalas,кусок
gabaliukas,кусочек
graža,сдача
indėlis,контейнер,одноразовый контейнер для еды
ketvirtadalis,четверть,четвертая часть - в одно слово
maišelis,пакетик/мешочек
pakelis,упаковка/пачка
pusė,половина
riekė,ломтик/кусок,например хлеба
sąskaita,счёт,например в ресторане
trečdalis,треть,третья часть - в одно слово
